{"review":"This show is awesome and we have been enjoying it thoroughly. Set in Alaska, I don't agree with the homosexual content on tonight's show. I feel that you are pushing too hard to bring New York to Alaska. Its one thing to have a New Yorker struggling in the Alaska wild, but to try to turn the Alaska town into New York? This is a nice show about dainty women and true Alaska Men and to bring a same sex couple into the mix is throwing the balance way off. Alaska should be Portrayed as a man and New York as the woman. I think the first 9 shows have the perfect balance with what you all are doing. Can't we have a nice show without the imbalance of nature.","label":0,"predicted":1}
{"review":"The movie was a pleasure to watch if you are a fan of the Stooges. The story is told from the point of view of Moe Howard and his relationships with his brothers Shemp and Jerome (Curly) Howard, also the life long friendship with Larry Fine. The movie deals mostly with the off camera high points and pit falls of the Stooges multi decade career. The casting director and makeup artist did a fair job of finding actors who resembled the famous ensemble. The actor who plays \"Curly\" Howard did a fine job of portraying the on camera antics of the most beloved Stooge. A must see for any fan of Three Stooges shorts.","label":0,"predicted":1}
{"review":"After seeing Forever Hollywood, it would be natural to want to see a John Waters film. At least, one get to say that they have joined the legions of cinema cognoscenti who have experienced the unique cinematic stylings of perhaps the best known non-mainstream director. It's worth the effort, and PF is a lot better than Eraserhead,and there is a certain campiness about his films which his followers find addicting.","label":0,"predicted":1}
{"review":"Man, I can't believe the largely harsh and negative comments for this movie. Okay, it sure ain't no sophisticated work of cinematic art. But it is a good deal of entertainingly tacky fun. For starters, the titular pumpkin-headed supernatural killer dude has to be one of the single most laughably silly and unscary things to ever stumble in front of a camera; he looks like something you would see in a fourth-rate carnival spookhouse. Secondly, the moderate gore is ridiculously fake and unconvincing, with the definite highlight occurring when this annoying uptight ultra-conservative woman gets electrocuted by a toaster. Then there's the always welcome presence of the ever-lovely Linnea Quigley, who's memorably introduced taking a nice, long, utterly gratuitous shower that goes on for two minutes. Amazingly, we also have appearances by deceased schlock picture legends John Carradine as an evil warlock and Cameron Mitchell as a horror TV show host. Moreover, scream queens Brinke Stevens and Dawn Wildsmith have fleeting cameos. Lead child actor Ryan Latshaw projects all the charm and acting ability of a moldy old tree stump. Pretty brunette Rachel Carter pops her top and bares her cute little breasts. The cruddy special effects are decidedly less than special. The score is suitably overwrought. Yet this film overall has a certain endearingly hokey appeal to it which in turn makes this honey a real delectably cheesy hoot to watch.","label":1,"predicted":0}
{"review":"Uzumaki succeeds as at plunging you into a bizarre surreality where Uzumaki shapes haunt and curse a town. It fails at being a competent horror movie. While the film is sure to draw attention mainly to it's bizarre plot line and a few interesting visual treats, it's going to come off better as a dark comedy than a horror film. It's definitely a film you should see if your into the kind of stuff- but if your looking for a scare or even a small chill, you'll want to look elsewhere. Uzumaki doesn't really have much else up it's sleeve but a great chain of odd events.<br \/><br \/>a","label":1,"predicted":0}
{"review":"Rabbit Fever is one of those film oddities. It's an enjoyable 90 minutes, demands little of the viewer, and delivers as much, and on any terrestrial television channel even in a prime time slot I think that Rabbit Fever would be rather well received. Which makes me wonder why it has been pushed into cinemas.<br \/><br \/>The movie is filmed in the style of a television documentary, and introduces us to 6 women who have am addictive relationship with the Rabbit Vibrator. The film is primarily focused on investigating a supposed addictive quality to the famous sex aid product. The narrative is 100% tongue in cheek throughout.<br \/><br \/>The storyline is strong, an introduction to some well rounded and likable characters, some enjoyable back-story, peripheral characters and situations develops into an engaging story, and pleasing conclusions. Sadly there's nothing that feels clever or new. <br \/><br \/>Rabbit Fever has some sharp moments, a few switches that hint at what the writers are capable of, and all credit to them it's not just 90 minutes of knob gags and innuendo, I could probably watch it with my mother. But there's a laziness about some of the scenes that holds it back, those moments went you are up for it, when you want it to be outrageous, and all you get is a dollop of sit-com.<br \/><br \/>I chuckled, I left the theatre feeling empathy for the characters, but I also left with the bitter thought that someone had taken a 90 minute reel of made for TV, light entertainment and tried to put it into national cinema. <br \/><br \/>I think Rabbit Fever achieves some of what it set out to do, it's a quirky subject, a rounded storyline, a well presented cast and a good diversion for 90 minutes. But there's nothing in this that can justify the extravagance of a movie theatre environment. Quite the opposite - a few commercial breaks would have given the viewer chance to grab a breath of life that Rabbit Fever seems to lack.","label":0,"predicted":1}
{"review":"It seems everyone wants to jump on the bandwagon and say \"Maha Go Go Go\"....The word is MACHA........Like \"Mach\".....Pronounced maa - ka\"...<br \/><br \/>I grew up with this series in the early 70's here in LA on the late and VERY lamented channel 56...Before that there was Tetsuwan Atomu (Astro Boy), dating from 1963 on ol' KHJ TV. Astro Boy was the first TV example of anime we got here in the states...I was into anime as a kid and followed it until the late 80's when, by then it'd become a series of badly animated \"talking heads\", a phenomenon which has only gotten worse. 'Nuff said.<br \/><br \/>As for \"Speed Racer\", I really enjoyed the basics there, the POV shots, the cinematic aspects of live action skillfully adopted to animation...That was fairly typical of most Japanese anime back then...Graphics graphics graphics! Take note sometime how obviously the series was inspired by Stanley Kramer's film \"Grand Prix\" (1966), especially the redone American credits....<br \/><br \/>Oh yeah, I have the original comics from which the series is based, so I know of which I speak.<br \/><br \/>What were we doing animation-wise besides crap like Johnny Quest?.....Th' same ol' stuff we'd been doin' since the 20's....Ho-hum!<br \/><br \/>I guess the real problem I had\/have with the way anime was\/is shown on American TV is the hatchet job done on the scripts, credits, etc to \"sanitize\" them for American audiences...I won't go into other programs as we're talking' Speed here.<br \/><br \/>Look at clowns like Peter Fernandez as one of the culprits here, as he was 99% responsible for the re-writes of the series...Not to mention the voice of Speed, Racer X and others...Between him and the goofs at Trans\/Lux ( Think Felix the Cat and the Mighty Hercules - oy vey!) they took a slick, very sophisticated show and dropped it down to the level of Sesame Street. Think \"Cruncher Bloch\", The \"Forthebird Company\", \"Skull Duggery\"...If I go on I'll puke.<br \/><br \/>This series dates from 40-odd years ago but I, at the time, was keen enough to feel insulted by the dumbing down of this and other Japanese programs...I mean it's obvious when someone's getting' killed but they either remove it or gloss it over........Pleeeeeze!<br \/><br \/>Good show - originally. Sadly all the more recent incarnations of the series have that CRAPPY \"made in Korea\" look, not to mention being nauseatingly \"pc\" in content. Even the Japanese outsource their animation now..<br \/><br \/>Try watchin' the original Japanese opening on YouTube sometime...It sends chills up my spine.....If only......Oh well. Robert","label":1,"predicted":0}
{"review":"The parallels between this film and \"Captain Walrus\" (an independant film shown at the Team Projection Film Festival in 1994) are so blindingly obvious that any praise for \"Sally Marshall Is Not An Alien\" must be viewed with the knowledge that it is riding on the success of another work.<br \/><br \/>In Captain Walrus, two young boys (Geoff and Roger, played by Dean Turner and Brett Allen respectively) examine the bizarre behaviour of their new neighbour Britney (played by Louise Farley). As the two boys watch through their telescope, they observe the repeated visits of a man in uniform who they call Captain Walrus (played by Peter Sargent). However, the emphasis in Captain Walrus is on the pointless and somewhat power-hungry actions of the neighbour Britney, and less on the friendship between the two boys.<br \/><br \/>A critical success at the film festival, the plot of Captain Walrus has obviously been appropriated and rehashed in order to give the Australian Film Community another notch on the belt with regards to children's product. Although Sally Marshall is not an Alien is a fine film, and a credit to its producers, its inauthenticity leaves something to be deserved.","label":0,"predicted":1}
{"review":"This movie is kind of good. It seem that they used the Tyrannosaurus Rex like a blown up balloon, just like Godzilla, just maybe back in those 60-70's days, scientist haven't got enough info. on all sorts of dinosaurs. Back in those time scientist still making dinosaur, so I guess this movie was base on a Tyrannosaurus Rex movements back in the 60-70's. There even a part where a giant rock, fired by someone at the Tyrannosaurus Rex, it damage the Tyrannosaurus Rex and it was knock out for a little while. At the end, the Tyrannosaurus Rex went back to search for food. There is something wrong in the movie as well, like a rifle, how can one rifle kill a Tyrannosaurus Rex, when it could be 1,000-5,000 stronger than we are. If this film going to make a remake, I suggest make it more good and excited, because watching a old movie seems like to have a remake of it, if lucky.","label":1,"predicted":0}
{"review":"Check out the two octogenarians who review Leatherheads. These guys are old-school Hollywood and a hit on YouTube. They always give an insightful and fun review. They have movie comparisons that are really interesting and they have a banter back and forth that is endlessly entertaining. They know movies, collectively they have been in the biz for practically a century. Lorenzo is a well-known screenwriter and Marcia is a famous producer. All of their insight on movies always leaves you with something to think about. See what they think about Clooney's latest...<br \/><br \/>http:\/\/www.youtube.com\/watch?v=2-W7evBEArs","label":0,"predicted":1}